LIMPIEZA DATOS CSV:

In [2]:
import pandas as pd
import numpy as np
from IPython.display import display

In [3]:
df = pd.read_csv("data.csv", index_col=0) # cargo el archivo CSV

display(df.head())# muestra las 5 primeras filas

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,...,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,...,20,NaN,15,15,"16280,83$",1972,"195370,00$",NaN,NaN,Yes
1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,...,33,NaN,11,9,NaN,1971,"199990,00$",NaN,NaN,1
2,42,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,...,22,NaN,11,15,NaN,1981,"192320,00$",ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,...,20,NaN,5,6,"14307,50$",1976,"171690,00$",NaN,NaN,False
4,46,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,...,19,NaN,2,8,"12783,92$",1977,NaN,NaN,NaN,0

In [4]:
# Identificar valores nulos: hay varias columnas con valores Nan, hay que ver que columnas tienen esos valores y tomar decisiones.
df.isnull().sum()

age                            0
attrition                      0
businesstravel               801
dailyrate                      0
department                  1366
distancefromhome               0
education                      0
educationfield               774
employeecount                  0
employeenumber                 0
environmentsatisfaction        0
gender                         0
hourlyrate                  1267
jobinvolvement                 0
joblevel                       0
jobrole                        0
jobsatisfaction                0
maritalstatus                675
monthlyincome                489
monthlyrate                    0
numcompaniesworked             0
over18                       938
overtime                     696
percentsalaryhike              0
performancerating            200
relationshipsatisfaction       0
standardhours                351
stockoptionlevel               0
totalworkingyears            549
trainingtimeslastyear          0
worklifebalance              114
yearsatcompany                 0
yearsincurrentrole          1643
yearssincelastpromotion        0
yearswithcurrmanager           0
sameasmonthlyincome          489
datebirth                      0
salary                       285
roledepartament             1366
numberchildren              1678
remotework                     0
dtype: int64

In [5]:
# para ver porcentaje de valores numos en cada columna:

(df.isnull().sum() / len(df)) * 100

age                           0.000000
attrition                     0.000000
businesstravel               47.735399
dailyrate                     0.000000
department                   81.406436
distancefromhome              0.000000
education                     0.000000
educationfield               46.126341
employeecount                 0.000000
employeenumber                0.000000
environmentsatisfaction       0.000000
gender                        0.000000
hourlyrate                   75.506555
jobinvolvement                0.000000
joblevel                      0.000000
jobrole                       0.000000
jobsatisfaction               0.000000
maritalstatus                40.226460
monthlyincome                29.141836
monthlyrate                   0.000000
numcompaniesworked            0.000000
over18                       55.899881
overtime                     41.477950
percentsalaryhike             0.000000
performancerating            11.918951
relationshipsatisfaction      0.000000
standardhours                20.917759
stockoptionlevel              0.000000
totalworkingyears            32.717521
trainingtimeslastyear         0.000000
worklifebalance               6.793802
yearsatcompany                0.000000
yearsincurrentrole           97.914184
yearssincelastpromotion       0.000000
yearswithcurrmanager          0.000000
sameasmonthlyincome          29.141836
datebirth                     0.000000
salary                       16.984505
roledepartament              81.406436
numberchildren              100.000000
remotework                    0.000000
dtype: float64

Eliminar columnas con demasiados nulos (>80%)
Si una columna tiene más del 80% de valores nulos, lo mejor es eliminarla, porque tiene poca información útil.
Columnas para  eliminar:
- "department" (81.40%)
- "roledepartament" (81.40%)
- "numberchildren" (100%)
- "yearsincurrentrole" (97.91%)

In [6]:
df.drop(columns=["department", "roledepartament", "numberchildren", "yearsincurrentrole"], inplace=True)

In [7]:
df.head() # vemos que hay 37 columnas ahora, se han eliminado bien.

,age,attrition,businesstravel,dailyrate,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,...,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,remotework
0,51,No,NaN,2015.722222,6,3,NaN,1,1,1,...,NaN,5,"3,0",20,15,15,"16280,83$",1972,"195370,00$",Yes
1,52,No,NaN,2063.388889,1,4,Life Sciences,1,2,3,...,"34,0",5,"3,0",33,11,9,NaN,1971,"199990,00$",1
2,42,No,travel_rarely,1984.253968,4,2,Technical Degree,1,3,3,...,"22,0",3,NaN,22,11,15,NaN,1981,"192320,00$",1
3,47,No,travel_rarely,1771.404762,2,4,Medical,1,4,1,...,NaN,2,NaN,20,5,6,"14307,50$",1976,"171690,00$",False
4,46,No,NaN,1582.771346,3,3,Technical Degree,1,5,1,...,NaN,5,"3,0",19,2,8,"12783,92$",1977,NaN,0

In [8]:
df.dtypes[["businesstravel", "educationfield","maritalstatus" , "overtime", "performancerating" , "hourlyrate", "monthlyincome", "over18", "standardhours", "worklifebalance", "sameasmonthlyincome", "salary", "totalworkingyears"]]

businesstravel          object
educationfield          object
maritalstatus           object
overtime                object
performancerating       object
hourlyrate             float64
monthlyincome           object
over18                  object
standardhours           object
worklifebalance         object
sameasmonthlyincome     object
salary                  object
totalworkingyears       object
dtype: object

Cambiar datos NaN a Null: 
Chatgpt
pd.notna(df[col]) es una función de Pandas que nos ayuda a identificar qué valores NO son NaN dentro de una columna. 

¿Qué hace pd.notna(df[col])?

Esta función devuelve un array de valores True o False, donde:
✅ True → Significa que el valor NO es NaN (es decir, hay un dato válido).
❌ False → Significa que el valor ES NaN (es decir, falta información).

In [9]:
#  transformar esta columna en formato INT.

df["performancerating"] = df["performancerating"].astype(str).str.replace(",", ".").astype(float)

# .astype(str) -> Convierte todos los valores en texto.
# .str.replace(",", ".") -> Reemplaza las comas por puntos.
# .astype(float) -> Convierte la columna a número

In [10]:
df["performancerating"].dtype

dtype('float64')

In [11]:
df["performancerating"].head()

0    3.0
1    3.0
2    3.0
3    3.0
4    3.0
Name: performancerating, dtype: float64

In [12]:
# para una sola columna seria:

df["salary"] = df["salary"].where(pd.notna(df["salary"]), None)

# Explicación del código:
#  pd.notna(df["salary"]) detecta los valores no nulos (True) y los valores NaN (False).
#  .where(pd.notna(df["salary"]), None) mantiene los valores True (no NaN) y reemplaza los False (NaN) con None.

In [13]:
df["salary"].isnull().sum()

np.int64(285)

In [14]:
# reviso la columna y ya esta cambiado NaN por None.

df["salary"].sample(10)

538      53914,11$
309      52570,00$
855      53914,11$
1231     28111,13$
690      53914,11$
899      26540,00$
1345     21210,00$
425      53914,11$
606      53914,11$
130     191324,62$
Name: salary, dtype: object

In [15]:
# Voy a cambiar los datos NaN que dan error en SQL por None en las columnas que faltan.

columnas_a_convertir = ["businesstravel", "educationfield","maritalstatus" , "overtime", "performancerating" , "hourlyrate", "monthlyincome", "over18", "standardhours", "worklifebalance", "sameasmonthlyincome", "salary", "totalworkingyears"]
for col in columnas_a_convertir:
    df[col] = df[col].where(pd.notna(df[col]), None)

# pd.notna(df[col]) -> Detecta los valores que no son NaN.
# .where(...) -> Mantiene los valores correctos y reemplaza los NaN con None.

In [16]:
df[["hourlyrate", "monthlyincome", "over18", "standardhours", "worklifebalance", "sameasmonthlyincome", "salary","totalworkingyears"]].sample(10)

,hourlyrate,monthlyincome,over18,standardhours,worklifebalance,sameasmonthlyincome,salary,totalworkingyears
285,NaN,None,None,Full Time,"3,0",None,"153407,07$",None
540,NaN,"5228,33$",Y,Full Time,"3,0","5228,33$","62740,00$","6,0"
1573,69.532083,"4492,84$",Y,Part Time,"3,0","4492,84$","53914,11$","10,0"
612,217.762897,None,Y,Full Time,"2,0",None,"168850,00$",None
749,118.702381,"7670,00$",None,Full Time,None,"7670,00$","92040,00$","7,0"
1187,NaN,None,Y,Full Time,"3,0",None,"171590,00$",None
1143,104.502976,"6752,50$",None,Full Time,"2,0","6752,50$","81030,00$","9,0"
1537,NaN,"4492,84$",None,None,"3,0","4492,84$",None,None
595,129.060911,None,Y,Part Time,"2,0",None,"100071,84$","10,0"
1121,NaN,"4492,84$",None,None,"3,0","4492,84$",None,None

Siguientes pasos:

- hay simbolo $ en valores de columna de precios o sueldos, mejor quitarlo y poner el $ en el nombre de la columna.
- hay textos escritos con errores tipograficos 
- hay textos escritos diferentes, con mayusculas o minusculas.
- hay espacios delante o detras en algunos OBJECTS.
- cambiar gender de 0-1 a Male o Female.

# Posibilidad de Rellenar valores nulos con datos adecuados

Algunas columnas tienen nulos moderados (10-50%), se puede rellenar con valores adecuados.
-> Posibles opciones de relleno:
"businesstravel" -> Rellenar con "No Travel" (si el nulo significa que no viajan).
"educationfield" -> Rellenar con "Unknown" si no conocemos el campo de estudio.
"maritalstatus" -> Rellenar con "Single" (opción estándar si faltan datos).
"overtime" -> Rellenar con "No" (asumiendo que el nulo significa que no hacen horas extra).
"performancerating" -> Rellenar con la media o mediana o poner none

---------------------------------------------------------------------------------------------------------

LIMPIEZA DATA COLUMNAS:  'age', 'attrition', 'businesstravel', 'department', 'educationfield',
       'jobrole', 'maritalstatus', 'monthlyincome', 'monthlyrate', 'over18'

In [17]:
# 1. EXPLORAR COLUMNAS:

In [18]:
df.columns.tolist() # saco los nombres de las columnas en una lista.

['age',
 'attrition',
 'businesstravel',
 'dailyrate',
 'distancefromhome',
 'education',
 'educationfield',
 'employeecount',
 'employeenumber',
 'environmentsatisfaction',
 'gender',
 'hourlyrate',
 'jobinvolvement',
 'joblevel',
 'jobrole',
 'jobsatisfaction',
 'maritalstatus',
 'monthlyincome',
 'monthlyrate',
 'numcompaniesworked',
 'over18',
 'overtime',
 'percentsalaryhike',
 'performancerating',
 'relationshipsatisfaction',
 'standardhours',
 'stockoptionlevel',
 'totalworkingyears',
 'trainingtimeslastyear',
 'worklifebalance',
 'yearsatcompany',
 'yearssincelastpromotion',
 'yearswithcurrmanager',
 'sameasmonthlyincome',
 'datebirth',
 'salary',
 'remotework']

In [19]:
df[['age', 'attrition', 'businesstravel', 'educationfield','jobrole', 'maritalstatus', 'monthlyincome', 'monthlyrate', 'over18']].head(3)

,age,attrition,businesstravel,educationfield,jobrole,maritalstatus,monthlyincome,monthlyrate,over18
0,51,No,None,None,resEArch DIREcToR,None,"16280,83$","42330,17$",Y
1,52,No,None,Life Sciences,ManAGeR,None,None,"43331,17$",None
2,42,No,travel_rarely,Technical Degree,ManaGER,Married,None,"41669,33$",None

In [20]:
df[['age', 'attrition', 'businesstravel', 'educationfield','jobrole', 'maritalstatus', 'monthlyincome', 'monthlyrate', 'over18']].dtypes

age               object
attrition         object
businesstravel    object
educationfield    object
jobrole           object
maritalstatus     object
monthlyincome     object
monthlyrate       object
over18            object
dtype: object

*** AGE ***

In [67]:
# analizo columna AGE: son edades pero aparece como objetc, hay que pasarlo a INT.

df['age'].sample(15)

# vemos que hay algunos valores escritos en letra.

1060    44
1127    31
959     35
889     36
1349    40
1252    34
1454    44
242     54
815     46
974     35
717     25
827     51
1476    55
888     49
415     36
Name: age, dtype: int64

In [22]:
df["age"] = df["age"].str.strip() # primero quito los posibles espacios que puedan haber antes o despues del numero.

- He intentado cambiar el tipo de columna con .astype() pero me ha estado dando error hasta que he visto que hay numeros escritos en letra en ingles.

-> df["age"] = df["age"].astype(int)  # astype() se usa para cambiar el tipo de dato de una columna 

- esto da error puesto que hay numeros escritos en ingles y eso no se puede convertir directamente con .astype()

Podria solucionar esto de dos formas:
- Creando un diccionario a mano con las palabras como clave y el numero como valor y luego definiendo una funcion para cambiarlo:
        * numeros = { "eighteen":18, "nineteen":19, "twenty": 20....}

- usar una libreria externa WORD2NUMBER que hace justo eso: convierte texto en ingles a número. Se instala como todas:
    pip install word2number
    from word2number import w2n

    w2n.word_to_num("forty_seven") -> devuelte 47 en numero 

    la libreria es mas rapido y limpio

In [23]:
# pip install word2number    como ya he hecho el pip install no inhabilito.

In [24]:
from word2number import w2n

In [25]:
# ya he importado la libreria, hago una funcion para limpiar la columna age:
# necesito pasarlo todo a texto/string primero.

def convertir_edad(valor):  # Definimos la función. Le pasaremos una edad, que puede ser: un numero ("42"), un string o un Nulo (NaN)
    if pd.isnull(valor):    # Si el valor es nulo (NaN), lo dejamos como None. 
        return None
    valor = str(valor).strip().lower() # str(valor) lo convierte a texto/string por si viene como numero, con .strip() elimino posibles espacios y .lower()lo paso todo a minusculas.
    try:
        return int(valor) if valor.isdigit() else w2n.word_to_num(valor)  # si el valor es .isdigit() significa que es un numero tipo "42" y uso INT para convertirlo, si no es numero sino letra (forty-two) uso w2n para traducirlo.
    except:
        return None  # Por si hay algún texto no válido


#con el try me aseguro de cambiar a INT si es un "35" y me de 35 y si esta escrito "twenty" uso w2n para que me de 20 en INT

In [26]:
df["age"] = df["age"].apply(convertir_edad)

# con apply aplico la funcion que acabo de hacer a cada fila de la columna AGE para que realice los cambios a INT. 
# El resultado se guarda en la misma columna.

In [68]:
df["age"].head(5)

# ya aparece como INT.

0    51
1    52
2    42
3    47
4    46
Name: age, dtype: int64

RESUMEN DE CAMBIOS DE AGE:
- .strip()
Elimina espacios en blanco al principio y al final de un string.
Ejemplo: ' hola '.strip() → 'hola'
- .isdigit()
Devuelve True si todos los caracteres del string son dígitos (números enteros positivos).
Ejemplo: '42'.isdigit() → True, 'forty-two'.isdigit() → False.  No detecta decimales, negativos ni espacios. 
- .apply()
Aplica una función a cada valor de una columna (o fila si se usa con axis=1).
El resultado se guarda en la columna.

*** attrition ***

In [28]:
df['attrition'].head()

# pasar a minusculas
# quitar posibles espacios.

0    No
1    No
2    No
3    No
4    No
Name: attrition, dtype: object

In [29]:
df["attrition"] = df["attrition"].str.strip().str.lower()

# .str.strip().str.lower() limpia espacios y pone todo en minúsculas.

In [30]:
df['attrition'].sample(3)

967    yes
374     no
876     no
Name: attrition, dtype: object

*** Businesstravel ***

In [72]:
df["businesstravel"].sample(5)

# quitar espacios
# poner todo en minusculas
# quitar los _ y dejar espacios " "

848              None
1274    travel rarely
1410             None
1096    travel rarely
329     travel rarely
Name: businesstravel, dtype: object

In [32]:
df["businesstravel"] = (df["businesstravel"].str.strip().str.lower().str.replace("_", " "))

# .str.replace("_", " "): cambia guiones por espacios.
# .str.lower(): pone todo en minusculas.
# .str.strip(): limpia espacios extra.

In [33]:
df["businesstravel"].sample(5)

# al revisar veo que tambien hay guion medio en algunos valores.

1117             None
622     travel rarely
1423             None
26               None
169              None
Name: businesstravel, dtype: object

In [34]:
df["businesstravel"] = (df["businesstravel"].str.strip().str.lower().str.replace("_", " ").str.replace("-", " "))

# aqui incluyo el .replace del guion medio que no me habia dado cuenta antes.

In [35]:
df["businesstravel"].sample(5)

233     travel rarely
1065    travel rarely
41      travel rarely
576              None
1323    travel rarely
Name: businesstravel, dtype: object

*** Educationfield ***

In [36]:
df['educationfield'].sample(5)

# quitar espacios
# poner en minusculas.
# NaN -> None ya lo hice

310          None
1478         None
1165    Marketing
377     Marketing
423          None
Name: educationfield, dtype: object

In [37]:
df["educationfield"] = df["educationfield"].str.strip().str.lower()

In [38]:
df['educationfield'].sample(5)

464     life sciences
1533             None
1006             None
379              None
643              None
Name: educationfield, dtype: object

*** jobrole ***

In [39]:
df['jobrole'].sample(3)

# espacios al principio y al final
# poner en minusculas

845      hEaltHcare rEpREseNTatiVE
1453            rEsEArCh sCIENtIsT
587             REsearCH SCiEntist
Name: jobrole, dtype: object

In [40]:
df["jobrole"] = df["jobrole"].str.strip().str.lower()

In [41]:
df['jobrole'].sample(3)

1207                  manager
1361    laboratory technician
1496                  manager
Name: jobrole, dtype: object

*** Maritalstatus ***

In [42]:
df['maritalstatus'].sample(20)

# quitar posibles espacios.
# poner en minusculas.
# hay error ortografico  en married alguno pone "marreid"

356      Married
1635     Married
717       Single
919         None
849      Married
1107        None
745      Married
939       Single
632      Married
892         None
1623     Marreid
1016    Divorced
1428      Single
72          None
145      Married
1393      Single
893      Married
1055        None
1399        None
526       Single
Name: maritalstatus, dtype: object

In [43]:
df["maritalstatus"] = df["maritalstatus"].str.strip().str.lower()

In [44]:
df["maritalstatus"] = df["maritalstatus"].replace("marreid", "married")

# .replace del error ortografico.

In [45]:
df["maritalstatus"].sample(5)

637       single
1058      single
815     divorced
25       married
1302        None
Name: maritalstatus, dtype: object

*** Monthlyincome ***

In [46]:
df['monthlyincome'].sample(5)

# pasar a float (reemplazar , por . para float)
# quitar espacios
# quitar simbolo $

1566        None
11          None
966         None
83      8339,32$
1526    2214,17$
Name: monthlyincome, dtype: object

In [47]:
df["monthlyincome"] = (df["monthlyincome"].str.strip().str.replace("$", "").str.replace(",", ".").astype(float))

# .str.strip() -> quitar espacios
# .str.replace() -> quitar el símbolo $
# .str.replace() -> cambiar coma por punto
# .astype(float) -> convertir a número decimal

In [48]:
df['monthlyincome'].sample(5)

# veo que aqui aparecen nulos como NaN que no se cambiaron al inicio, los cambio ahora.

537     3018.33
238         NaN
1323    4267.50
311     4492.84
1198    1980.83
Name: monthlyincome, dtype: float64

In [49]:
df["monthlyincome"] = df["monthlyincome"].where(pd.notnull(df["monthlyincome"]), None) # Deja los valores que no son nulos como están, y cambia los NaN por None.

In [50]:
df['monthlyincome'].sample(5)

845    4492.84
975        NaN
901        NaN
835    2342.59
181    4492.84
Name: monthlyincome, dtype: float64

*** IMPORTANTE ***

Siguen apareciendo valores Nan porque Pandas sigue mostrando NaN incluso si internamente hay None, cuando la columna tiene tipo numérico (float64 en este caso) Y Pandas no puede mezclar números con None en columnas de tipo float64, así que internamente lo convierte a NaN aunque tú hayas puesto None.
Como vamos a trabajar despues con SQL y tenemos que quitar esos valores Nan para que no nos den error tendremos que tener esta columna como OBJETC y no como FLOAT para poder tener valores nulos -> None.

In [51]:
# como ya le he quitado los espacios, la coma, y el $, pero está en FLOAT, ahora lo paso a OBJECT para poder tener NONE

In [52]:
df["monthlyincome"] = df["monthlyincome"].astype("object")
df["monthlyincome"] = df["monthlyincome"].where(pd.notnull(df["monthlyincome"]), None) # Deja los valores que no son nulos como están, y cambia los NaN por None.

# ahora esta como OBJETC y NONE

In [53]:
df['monthlyincome'].sample(5)

1485     2350.83
327         None
1620     2342.59
806     15789.17
1605        None
Name: monthlyincome, dtype: object

*** Monthlyrate ***

In [54]:
df["monthlyrate"].sample(5)

# lo mismo que en el anterior pero primero voy a comprobar si hay algun NaN

1166     6090,75$
1644     6090,75$
258     28905,50$
644     16804,67$
627     11681,39$
Name: monthlyrate, dtype: object

In [55]:
df["monthlyrate"].isna().sum()

# como esta columna no tiene NaN si que voy a pasarlo a Float.

np.int64(0)

In [56]:
df["monthlyrate"] = (df["monthlyrate"].str.strip().str.replace("$", "").str.replace(",", ".").astype(float))

In [57]:
df["monthlyrate"].sample(5)

238     21502.00
593     11681.39
95      11681.39
146     29416.83
1046    20284.33
Name: monthlyrate, dtype: float64

*** Over18 ***

In [58]:
df["over18"].sample(5)

# todos los valores son "Y" o None, no aporta informacion util, eliminarla.
# voy a poner en minuscula y quitar espacios de todas formas.

1614       Y
293     None
1300       Y
1505    None
787     None
Name: over18, dtype: object

In [59]:
df["over18"] = df["over18"].str.strip().str.lower()

In [60]:
df["over18"].sample(5)

755        y
881     None
1030       y
852        y
640        y
Name: over18, dtype: object